constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    back
    {
        type            wall;
        inGroups        2(stationaryWalls wall);
        nFaces          1984;
        startFace       3840;
    }
    sides
    {
        type            wall;
        inGroups        2(stationaryWalls wall);
        nFaces          40;
        startFace       5824;
    }
    bottom
    {
        type            wall;
        inGroups        2(stationaryWalls wall);
        nFaces          100;
        startFace       5864;
    }
    front
    {
        type            wall;
        inGroups        2(stationaryWalls wall);
        nFaces          1984;
        startFace       5964;
    }
    atmosphere
    {
        type            patch;
        nFaces          100;
        startFace       7948;
    }
    floatingObject
    {
        type            wall;
        inGroups        1(wall);
        nFaces          16;
        startFace       8048;
    }
)

// ************************************************************************* //
