system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-2.5 0 0)
    (2.5 0 0)
    (2.5 1 0)
    (-2.5 1 0)
    (-2.5 0 1)
    (2.5 0 1)
    (2.5 1 1)
    (-2.5 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 20 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    back
    {
        type wall;
		inGroups (stationaryWalls);
        faces
        (
            (0 3 2 1)
        );
    }
	sides
    {
        type wall;
		inGroups (stationaryWalls);
        faces
        (
            (2 6 5 1)
            (0 4 7 3)
        );
    }
    bottom
    {
        type wall;
		inGroups (stationaryWalls);
        faces
        (
            (1 5 4 0)
        );
    }
    front
    {
        type wall;
		inGroups (stationaryWalls);
        faces
        (
            (4 5 6 7)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
			(3 7 6 2)
        );
    }
    floatingObject
    {
        type wall;
        faces ();
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
